```
(base) wsiew@Williams-MacBook-Pro testing-wsiew % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.ibm_kms_instance_policies.test will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_kms_instance_policies" "test" {
      + dual_auth_delete         = (known after apply)
      + id                       = (known after apply)
      + instance_id              = (known after apply)
      + key_create_import_access = (known after apply)
      + metrics                  = (known after apply)
      + rotation                 = (known after apply)
    }

  # ibm_kms_instance_policies.key_protect_instance_policies will be created
  + resource "ibm_kms_instance_policies" "key_protect_instance_policies" {
      + id          = (known after apply)
      + instance_id = (known after apply)

      + key_create_import_access {
          + create_root_key     = true
          + create_standard_key = false
          + created_by          = (known after apply)
          + creation_date       = (known after apply)
          + enabled             = true
          + enforce_token       = false
          + import_root_key     = true
          + import_standard_key = false
          + last_updated        = (known after apply)
          + updated_by          = (known after apply)
        }
    }

  # ibm_kms_key_rings.key_ring will be created
  + resource "ibm_kms_key_rings" "key_ring" {
      + endpoint_type = (known after apply)
      + id            = (known after apply)
      + instance_id   = (known after apply)
      + key_ring_id   = "key-ring-id"
    }

  # ibm_resource_instance.key_protect_instance will be created
  + resource "ibm_resource_instance" "key_protect_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "eu-gb"
      + locked                  = (known after apply)
      + name                    = "tmp-kp"
      + plan                    = "tiered-pricing"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = "f956c41a82d1436fbbf68f418f831c05"
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "kms"
      + service_endpoints       = "public-and-private"
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_resource_instance.key_protect_instance: Creating...
ibm_resource_instance.key_protect_instance: Still creating... [10s elapsed]
ibm_resource_instance.key_protect_instance: Creation complete after 14s [id=crn:v1:bluemix:public:kms:eu-gb:a/eba0f7b1166e441ab74ac94e564c72ec:a83be57f-8669-473c-adda-87a493a62769::]
ibm_kms_key_rings.key_ring: Creating...
ibm_kms_instance_policies.key_protect_instance_policies: Creating...
ibm_kms_instance_policies.key_protect_instance_policies: Creation complete after 3s [id=crn:v1:bluemix:public:kms:eu-gb:a/eba0f7b1166e441ab74ac94e564c72ec:a83be57f-8669-473c-adda-87a493a62769::]
data.ibm_kms_instance_policies.test: Reading...
ibm_kms_key_rings.key_ring: Creation complete after 4s [id=key-ring-id:keyRing:crn:v1:bluemix:public:kms:eu-gb:a/eba0f7b1166e441ab74ac94e564c72ec:a83be57f-8669-473c-adda-87a493a62769::]
data.ibm_kms_instance_policies.test: Read complete after 1s [id=a83be57f-8669-473c-adda-87a493a62769]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
(base) wsiew@Williams-MacBook-Pro testing-wsiew % 
```

Some terraform logs involving the affected resources